cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71Q20.svd
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>IDATAR[%s]</name>
               <description>Input Data Register 0</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IDATA</name>
                     <description>Input Data Word</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>ODATAR[%s]</name>
               <description>Output Data Register 0</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>ODATA</name>
                     <description>Output Data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>IVR[%s]</name>
               <description>Initialization Vector Register 0</description>
               <addressOffset>0x60</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>IV</name>
                     <description>Initialization Vector</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>AADLENR</name>
               <description>Additional Authenticated Data Length Register</description>
               <addressOffset>0x70</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>AADLEN</name>
                     <description>Additional Authenticated Data Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CLENR</name>
               <description>Plaintext/Ciphertext Length Register</description>
               <addressOffset>0x74</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>CLEN</name>
                     <description>Plaintext/Ciphertext Length</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>GHASHR[%s]</name>
               <description>GCM Intermediate Hash Word Register 0</description>
               <addressOffset>0x78</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>GHASH</name>
                     <description>Intermediate GCM Hash Word x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>TAGR[%s]</name>
               <description>GCM Authentication Tag Word Register 0</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TAG</name>
                     <description>GCM Authentication Tag x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRR</name>
               <description>GCM Encryption Counter Value Register</description>
               <addressOffset>0x98</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>CTR</name>
                     <description>GCM Encryption Counter</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>4</dim>
               <dimIncrement>4</dimIncrement>
               <name>GCMHR[%s]</name>
               <description>GCM H Word Register 0</description>
               <addressOffset>0x9C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>H</name>
                     <description>GCM H Word x</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERSION</name>
               <description>Version Register</description>
               <addressOffset>0xFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>Version of the Hardware Module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>MFN</name>
                     <description>Metal Fix Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
