cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71Q20.svd
            <register>
               <name>CFR1</name>
               <description>SDRAMC Configuration Register 1</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TMRD</name>
                     <description>Load Mode Register Command to Active or Refresh Command</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>UNAL</name>
                     <description>Support Unaligned Access</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UNALSelect</name>
                        <enumeratedValue>
                           <name>UNSUPPORTED</name>
                           <description>Unaligned access is not supported.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SUPPORTED</name>
                           <description>Unaligned access is supported.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS</name>
               <description>SDRAMC OCMS Register</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SDR_SE</name>
                     <description>SDRAM Memory Controller Scrambling Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS_KEY1</name>
               <description>SDRAMC OCMS KEY1 Register</description>
               <addressOffset>0x30</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY1</name>
                     <description>Off-chip Memory Scrambling (OCMS) Key Part 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>OCMS_KEY2</name>
               <description>SDRAMC OCMS KEY2 Register</description>
               <addressOffset>0x34</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>Off-chip Memory Scrambling (OCMS) Key Part 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERSION</name>
               <description>SDRAMC Version Register</description>
               <addressOffset>0xFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>Version of the Hardware Module</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>MFN</name>
                     <description>Metal Fix Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
      <peripheral>
         <name>SMC</name>
         <version>6498J</version>
         <description>Static Memory Controller</description>
         <groupName>SMC</groupName>
         <prependToName>SMC_</prependToName>
         <baseAddress>0x40080000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x100</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <cluster>
               <dim>4</dim>
               <dimIncrement>16</dimIncrement>
               <name>SMC_CS_NUMBER[%s]</name>
               <description>SMC Setup Register (CS_number = 0)</description>
               <addressOffset>0x0</addressOffset>
               <register>
                  <name>SETUP</name>
                  <description>SMC Setup Register (CS_number = 0)</description>
                  <addressOffset>0x00</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NWE_SETUP</name>
                        <description>NWE Setup Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_SETUP</name>
                        <description>NCS Setup Length in WRITE Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NRD_SETUP</name>
                        <description>NRD Setup Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_SETUP</name>
                        <description>NCS Setup Length in READ Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>6</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>PULSE</name>
                  <description>SMC Pulse Register (CS_number = 0)</description>
                  <addressOffset>0x04</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NWE_PULSE</name>
                        <description>NWE Pulse Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_WR_PULSE</name>
                        <description>NCS Pulse Length in WRITE Access</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NRD_PULSE</name>
                        <description>NRD Pulse Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                     <field>
                        <name>NCS_RD_PULSE</name>
                        <description>NCS Pulse Length in READ Access</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>7</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>CYCLE</name>
                  <description>SMC Cycle Register (CS_number = 0)</description>
                  <addressOffset>0x08</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>NWE_CYCLE</name>
                        <description>Total Write Cycle Length</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                     <field>
                        <name>NRD_CYCLE</name>
                        <description>Total Read Cycle Length</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>9</bitWidth>
                     </field>
                  </fields>
               </register>
               <register>
                  <name>MODE</name>
                  <description>SMC Mode Register (CS_number = 0)</description>
                  <addressOffset>0x0C</addressOffset>
                  <size>32</size>
                  <fields>
                     <field>
                        <name>READ_MODE</name>
                        <description>Read Mode</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>WRITE_MODE</name>
                        <description>Write Mode</description>
                        <bitOffset>1</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>EXNW_MODE</name>
                        <description>NWAIT Mode</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>EXNW_MODESelect</name>
                           <enumeratedValue>
                              <name>DISABLED</name>
                              <description>Disabled-The NWAIT input signal is ignored on the corresponding chip select.</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>FROZEN</name>
                              <description>Frozen Mode-If asserted, the NWAIT signal freezes the current read or write cycle. After deassertion, the read/write cycle is resumed from the point where it was stopped.</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>READY</name>
                              <description>Ready Mode-The NWAIT signal indicates the availability of the external device at the end of the pulse of the controlling read or write signal, to complete the access. If high, the access normally completes. If low, the access is extended until NWAIT returns high.</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>BAT</name>
                        <description>Byte Access Type</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>BATSelect</name>
                           <enumeratedValue>
                              <name>BYTE_SELECT</name>
                              <description>Byte select access type:- Write operation is controlled using NCS, NWE, NBS0, NBS1.- Read operation is controlled using NCS, NRD, NBS0, NBS1.</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>BYTE_WRITE</name>
                              <description>Byte write access type:- Write operation is controlled using NCS, NWR0, NWR1.- Read operation is controlled using NCS and NRD.</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>DBW</name>
                        <description>Data Bus Width</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>1</bitWidth>
                        <enumeratedValues>
                           <name>DBWSelect</name>
                           <enumeratedValue>
                              <name>_8_BIT</name>
                              <description>8-bit Data Bus</description>
                              <value>0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_16_BIT</name>
                              <description>16-bit Data Bus</description>
                              <value>1</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                     <field>
                        <name>TDF_CYCLES</name>
                        <description>Data Float Time</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>4</bitWidth>
                     </field>
                     <field>
                        <name>TDF_MODE</name>
                        <description>TDF Optimization</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PMEN</name>
                        <description>Page Mode Enabled</description>
                        <bitOffset>24</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>PS</name>
                        <description>Page Size</description>
                        <bitOffset>28</bitOffset>
                        <bitWidth>2</bitWidth>
                        <enumeratedValues>
                           <name>PSSelect</name>
                           <enumeratedValue>
                              <name>_4_BYTE</name>
                              <description>4-byte page</description>
                              <value>0x0</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_8_BYTE</name>
                              <description>8-byte page</description>
                              <value>0x1</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_16_BYTE</name>
                              <description>16-byte page</description>
                              <value>0x2</value>
                           </enumeratedValue>
                           <enumeratedValue>
                              <name>_32_BYTE</name>
                              <description>32-byte page</description>
                              <value>0x3</value>
                           </enumeratedValue>
                        </enumeratedValues>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>OCMS</name>
               <description>SMC Off-Chip Memory Scrambling Register</description>
               <addressOffset>0x80</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SMSE</name>
                     <description>Static Memory Controller Scrambling Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS0SE</name>
                     <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS1SE</name>
                     <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS2SE</name>
                     <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>CS3SE</name>
                     <description>Chip Select (x = 0 to 3) Scrambling Enable</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY1</name>
               <description>SMC Off-Chip Memory Scrambling KEY1 Register</description>
               <addressOffset>0x84</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY1</name>
                     <description>Off-Chip Memory Scrambling (OCMS) Key Part 1</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>KEY2</name>
               <description>SMC Off-Chip Memory Scrambling KEY2 Register</description>
               <addressOffset>0x88</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>KEY2</name>
                     <description>Off-Chip Memory Scrambling (OCMS) Key Part 2</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>SMC Write Protection Mode Register</description>
               <addressOffset>0xE4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protect Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit. Always reads as 0.</description>
                           <value>0x534D43</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>SMC Write Protection Status Register</description>
               <addressOffset>0xE8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>VERSION</name>
               <description>SMC Version Register</description>
               <addressOffset>0xFC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>VERSION</name>
                     <description>Hardware Module Version</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
                  <field>
                     <name>MFN</name>
                     <description>Metal Fix Number</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>3</bitWidth>
                  </field>
               </fields>
            </register>
